<?php 
session_start();
?>
<div class="card shadow mb-4">
    <div class="card-header py-3">
        <h6 class="m-0 font-weight-bold text-primary">แบบแสดงความยินยอมในการเก็บ ใช้ และเปิดเผยข้อมูลส่วนบุคคล</h6>
    </div>
    <div class="card-body">
        <div class="text-center">
            <h5>ข้อตกลงและเงื่อนไขการใช้งาน</h5>
            <!-- <img class="img-fluid px-3 px-sm-4 mt-3 mb-4" style="width: 25rem;"
                                            src="img/undraw_posting_photo.svg" alt="..."> -->
        </div>
        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            ข้อมูลส่วนบุคคลที่จัดเก็บและใช้โดยวิทยาสัยเซนต์หลุยส์ ข้อมูลส่วนบุคคลที่วิทยาลัยเซนต์หลุยส์ได้รับมาจากการกรอกข้อมูลในขั้นตอนการสมัคร ในระหว่างศึกษา และสำเร็จการศึกษา จะถูกนำไปใช้ให้เป็นไปตามวัตถุประสงค์ที่กำหนดไว้ตามหนังสือนี้เท่านั้น
        </p>
        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            ข้าพเจ้ายินยอมให้วิทยาลัยเซนต์หลุยส์ในฐานะผู้ควบคุมข้อมูลส่วนบุคคลกระทำการเก็บรวบรวม ใช้ และเปิดเผยข้อมูลส่วนบุคคลภายใต้เงื่อนไข เพื่อนำไปใช้ประโยชน์ในการรับสมัครนักศึกษา การตรวจสอบวุฒิบัตร การลงทะเบียนเรียน การทำบัตรประจำตัวนักศึกษาและระเบียนสถิติ การบอกเลิก-บอกเพิ่ม และออกรายงานข้อมูลทะเบียนเรียนการจัดสอบและจัดกรรมการคุมสอบ การตรวจสอบหลักฐานการเข้าสอบ การประมวลผลการสอบไล่ การรับรองผลการศึกษา การออกหนังสือสำคัญ การแจ้งจบและเตรียมปริญญาบัตร การบริการทะเบียนประวัติและปรับฐานข้อมูลนักศึกษา การเก็บข้อมูลและบริการทางคอมพิวเตอร์ การตรวจสอบและรับรองวุฒิบัตรวิทยาลัยเซนต์หลุยส์และการแนะแนวและประชาสัมพันธ์ และการนำส่งหน่วยงานราชการหรือองค์กรวิชาชีพตามหนังสือที่ได้รับการอนุมัติจากอธิการบดี</p>
        <hr>
        <div class="text-center">
            <h5>คำชี้แจงเกี่ยวกับการแสดงความยินยอมในการเก็บ ใช้ และเปิดเผยข้อมูลส่วนบุคคล</h5>
        </div>

        <ul>
            <li>วิทยาลัยเซนต์หลุยส์จะเก็บรวบรวม ใช้ และเปิดเผยข้อมูลส่วนบุคคลภายใต้วัตถุประสงค์ที่แจ้งไว้</li>
            <li>เจ้าของข้อมูลส่วนบุคคลมีสิทธิตามกฎหมายดังต่อไปนี้</li>
            <ul>
                <li>สิทธิในการแก้ไขหรือเปลี่ยนแปลงข้อมูลส่วนบุคคลของตนเองให้ถูกต้องสมบูรณ์เป็นปัจจุบันภายใต้ข้อบังคับ ระเบียบ และระบบฐานข้อมูลของวิทยาลัยเซนต์หลุยส์</li>
                <li>สิทธิในการเข้าถึงหรือขอรับรองสำเนาถูกต้องเกี่ยวกับข้อมูลส่วนบุคคลของตนเองหรือขอให้เปิดเผยถึงการได้มาซึ่งข้อมูลส่วนบุคคลที่ตนเองไม่ได้ให้ความยินยอม</li>
                <li>สิทธิในการขอรับข้อมูลส่วนบุคคลของตนเองจากวิทยาลัยเซนต์หลุยส์ รวมทั้งขอให้วิทยาลัยเซนต์หลุยส์ ส่งหรือโอนข้อมูลส่วนบุคคลไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่น หรือขอรับข้อมูลส่วนบุคคลที่วิทยาลัยเซนต์หลุยส์ส่งหรือโอนให้กับผู้ควบคุมข้อมูลส่วนบุคคลอื่น</li>
                <li>สิทธิในการขอให้วิทยาลัยเซนต์หลุยส์ เปิดเผยถึงการได้มาซึ่งข้อมูลส่วนบุคคลของตนเอง ในขณะที่ไม่ได้ให้ความยินยอมในการเก็บรวบรวม ใช้ หรือเปิดเผย</li>
                <li>เจ้าของข้อมูลส่วนบุคคลมีสิทธิร้องเรียน ในกรณีที่ผู้ประมวลผลข้อมูลส่วนบุคคล หรือลูกจ้าง หรือผู้รับจ้างของวิทยาลัยเซนต์หลุยส์ฝ่าฝืนไม่ปฏิบัติตามพระราชบัญญัติคุ้มครอง ข้อมูลส่วนบุคคล พ.ศ. 2562</li>
            </ul>
        </ul>

        <hr>

        <div class="text-center">
            <p><b>ข้าพเจ้าได้รับทราบถึงข้อตกลงและเงื่อนไขการเก็บ ใช้ และเปิดเผยข้อมูลส่วนบุคคล ดังกล่าว และยินยอมตามเงื่อนไขดังกล่าวทุกประการ</b></p>
        </div>


        <div class="text-center">
            <div class="form-group">
                <div class="custom-control custom-checkbox small">

                    <input type="checkbox" class="custom-control-input" id="agree" name="pdpa" value="1">

                    <label class="custom-control-label" for="agree">ยินยอม</label>
                </div>
            </div>
        </div>
        <button type="button" class="btn btn-primary btn-user btn-block" id="next-1" disabled>NEXT</button>
        <hr>


        <script>
            document.addEventListener("DOMContentLoaded", function() {
                // ดึง element ของ checkbox และปุ่ม
                var agreeCheckbox = document.getElementById("agree");
                var nextButton = document.getElementById("next-1");

                // ฟังก์ชันเปิด/ปิดปุ่ม
                function toggleNextButton() {
                    nextButton.disabled = !agreeCheckbox.checked;
                }

                // เพิ่ม event listener ให้ checkbox
                agreeCheckbox.addEventListener("change", toggleNextButton);
            });
        </script>

    </div>
</div>